{
  "Introduction": "Introduction",
  "<0>@crossed/styled</0> is here to streamline your styling workflow, offering the same ease of use as style-components but with a cross-platform twist.": "<0>@crossed/styled</0> est là pour rationaliser votre flux de travail de style, offrant la même facilité d'utilisation que les composants de style mais avec une touche multiplateforme.",
  "Explore our ecosystem to develop cross-platform applications with<br/><2>react-native</2> and <4>react-native-web</4>": "Explorez notre écosystème pour développer des applications multiplateformes avec<br/><2>React Native</2> et <4>React Native Web</4>.",
  "Cross platform ecosystem": "Un écosystème mutli-plateforme",
  "Star us": "Likez",
  "Styled your component with unistyles": "Stylisez votre composant avec Unistyles",
  "Create your accessible component from anything": "Créez votre composant accessible à partir de n'importe quoi",
  "UI Component made with @crossed/primitive and @crossed/styled": "Composant d'interface utilisateur créé avec @crossed/primitive et @crossed/styled",
  "Comming soon": "Bientôt disponible",
  "Additionally, CSS simplifies maintenance and scalability, allowing for consistent style changes and design expansion as the website evolves.": "De plus, le CSS simplifie la maintenance et la scalabilité, permettant des modifications de style cohérentes et une expansion du design au fur et à mesure de l'évolution du site web",
  "Key Features": "Caractéristiques clés",
  "<0>Unified Codebase:</0> Maintain a single codebase to generate styles seamlessly for both React and React Native platforms.": "<0>Base de code unifiée :</0> Maintenez une seule base de code pour générer des styles de manière transparente pour les plateformes React et React Native.",
  "<0>Higher Order Component (HOC):</0> Unlock the power of hover, active, and focus states in your components effortlessly.": "<0>Composant d'ordre supérieur (HOC) :</0> Libérez la puissance des états hover, active et focus dans vos composants sans effort.",
  "<0>React-Native-Unistyles Integration:</0> Familiar with react-native-unistyles? Harness its potential with our library for an enhanced styling experience.": "<0>Intégration React-Native-Unistyles :</0> Familiarisé avec react-native-unistyles ? Exploitez son potentiel avec notre bibliothèque pour une expérience de stylisation améliorée.",
  "Dependencies used in @crossed/styled": "Dépendances utilisées dans @crossed/styled",
  "Dependencies used": "Dépendances utilisées",
  "Made with crossed ecosystem": "Réalisé avec l'écosystème crossed",
  "On this page": "Sur cette page",
  "Setup": "Configuration",
  "Guide": "Guide",
  "Concept": "Concept",
  "Usage": "Utilisation",
  "Reference": "Référence",
  "styled": "stylisé",
  "Registry": "Registre",
  "Install dependencies": "Installation des dépendances",
  "Configure": "Configuration",

  "Get @crossed/styled set up, step by step": "Mettez en place @crossed/styled, étape par étape",
  "You should finish installation and configure react-native-unistyles, click <2>here</2>": "Vous devriez terminer l'installation et configurer react-native-unistyles, cliquez <2>ici</2>",
  "For add style on server side rendering, you should add registry on server components (nextjs app router)": "Pour ajouter du style au rendu côté serveur, vous devriez ajouter un registre sur les composants serveur (routeur de l'application nextjs)",
  "Server side renderer": "Rendu côté serveur",
  "extended from": "{{componentName}} est étendu à partir du composant ",
  "font size props description": "Applique la taille de la police choisie. La valeur par défaut est 20.",
  "weight props description": "Applique le poids de la police choisie. La valeur par défaut est un poids de 400.",
  "color props description": "Applique la couleur de la police choisie. La couleur par défaut dépend du thème : noir pour le thème clair et blanc pour le thème foncé.",
  "size props description": "Appliquer une hauteur et un rembourrage horizontaux spécifiques à la vue.",
  "status props description": "Modifier la couleur d'arrière-plan",
  "variant props description": "Applique une variante préconfigurée ",
  "space props description": "Appliquer un espacement entre les composants dans l'élement Box",
  "center props description": "Ajoute la propriété align-items: center",
  "direction props description": "Choisi si la séparation est verticale ou horizontale",
  "code description": "Code est un composant utilisé pour afficher du code en ligne.",
  "card description": "La carte est un composant flexible utilisé pour regrouper et afficher du contenu dans un format clair et concis.",
  "kbd description": "Le composant kbd sert à indiquer quelle touche ou combinaison de touches permet d'effectuer une action donnée.",
  "list description": "List est utilisé pour afficher les éléments d'une liste. Il rend un élément <ul> par défaut.",
  "menuList description": "Un élément de liste simple",
  "alert description": "Les alertes sont utilisées pour communiquer un état qui affecte un système, une fonctionnalité ou une page.",
  "button description": "Le composant bouton est utilisé pour déclencher une action ou un événement, tel que l'envoi d'un formulaire, l'ouverture d'une boîte de dialogue, l'annulation d'une action ou l'exécution d'une opération de suppression.",
  "box description": "La boîte est un composant de mise en page utilisé pour regrouper des éléments et les espacer.",
  "center description": "Center est un composant de mise en page qui centre son enfant à l'intérieur de lui-même.",
  "xbox description": "Utilisé pour encadrer les éléments dans la direction horizontale",
  "ybox description": "Utilisé pour encadrer les éléments dans la direction vertical",
  "separator description": "Séparation visuelle ou sémantique du contenu",
  "anchor description": "Anchor est un élément accessible pour la navigation.",
  "B description": "L'élément B est utilisé pour attirer l'attention du lecteur sur le contenu de l'élément.",
  "heading description": "Les éléments H1 à H6 représentent six niveaux de titres de section.",
  "I description": "L'élément I représente une plage de texte qui se détache du texte normal pour une raison quelconque, comme un texte idiomatique, des termes techniques, des désignations taxonomiques, entre autres.",
  "P description": "Le P représente un paragraphe.",
  "text description": "Primitives de texte avec des thèmes propres à chaque police.",
  "Name": "Nom",
  "Preconfigured values": "Valeurs préconfigurées",
  "Example": "Exemple",
  "Anatomy": "Anatomie",
  "Return": "Retour",
  "Type any code here": "Entrer votre code ici"
}
